## 41: Menerapkan agregasi pada sejumlah kolom dengan agg()

In [2]:

import pandas as pd

#### Persiapan Data Frame

In [3]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

#### Menerapkan agregasi pada sejumlah kolom dengan agg()

In [ ]:
df.groupby('pclass').agg({'pclass':'count', 
                          'age':['mean', 'max'], 
                          'survived': 'mean'})

In [ ]:
df.groupby('pclass').agg(n_pass=('pclass', 'count'),
                         avg_age=('age', 'mean'),
                         max_age=('age', 'max'), 
                         survival_rate=('survived', 'mean'))

## 42: Mengurutkan data berdasarkan kolom tertentu

In [ ]:
import pandas as pd

#### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

#### Mengurutkan data berdasarkan kolom tertentu

In [ ]:
df.sort_values('age').head()

In [ ]:
df.sort_values('age', ascending=False).head()

In [ ]:
df.sort_values(['survived', 'age']).head()

## 43: Menangani whitespace pada Data Frame

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = {'nim': ['10', '11', '12', '13', '  '],
        'nama': ['adi', '  ', 'tejo', '  ', 'bejo']}

df = pd.DataFrame(data)
df

#### Menangani whitespace pada Data Frame

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df = df.replace(r'^\s*$', np.nan, regex=True)
df

In [ ]:
df.info()

## 44: Menata ulang penempatan kolom pada Data Frame

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

#### Menata ulang penempatan kolom pada Data Frame

In [ ]:
df[['D', 'C', 'A', 'E', 'B']]

In [ ]:
df

In [ ]:
df = df[['D', 'C', 'A', 'E', 'B']]
df